{
  "additional_special_tokens": [
    "<start_of_turn>",
    "<end_of_turn>",
    "<start_of_image>",
    "<end_of_image>",
    "<image_soft_token>",
    "<fim_prefix>",
    "<fim_middle>",
    "<fim_suffix>",
    "<tool_call>",
    "</tool_call>",
    "<unused_0>",
    "<unused_1>",
    "<unused_2>",
    "<unused_3>",
    "<unused_4>",
    "<unused_5>",
    "<unused_6>",
    "<unused_7>",
    "<unused_8>",
    "<unused_9>",
    "<unused_10>",
    "<unused_11>",
    "<unused_12>",
    "<unused_13>",
    "<unused_14>",
    "<unused_15>",
    "<unused_16>",
    "<unused_17>",
    "<unused_18>",
    "<unused_19>",
    "<unused_20>",
    "<unused_21>",
    "<unused_22>",
    "<unused_23>",
    "<unused_24>",
    "<unused_25>",
    "<unused_26>",
    "<unused_27>",
    "<unused_28>",
    "<unused_29>",
    "<unused_30>",
    "<unused_31>",
    "<unused_32>",
    "<unused_33>",
    "<unused_34>",
    "<unused_35>",
    "<unused_36>",
    "<unused_37>",
    "<unused_38>",
    "<unused_39>",
    "<unused_40>",
    "<unused_41>",
    "<unused_42>",
    "<unused_43>",
    "<unused_44>",
    "<unused_45>",
    "<unused_46>",
    "<unused_47>",
    "<unused_48>",
    "<unused_49>",
    "<unused_50>",
    "<unused_51>",
    "<unused_52>",
    "<unused_53>",
    "<unused_54>",
    "<unused_55>",
    "<unused_56>",
    "<unused_57>",
    "<unused_58>",
    "<unused_59>",
    "<unused_60>",
    "<unused_61>",
    "<unused_62>",
    "<unused_63>",
    "<unused_64>",
    "<unused_65>",
    "<unused_66>",
    "<unused_67>",
    "<unused_68>",
    "<unused_69>",
    "<unused_70>",
    "<unused_71>",
    "<unused_72>",
    "<unused_73>",
    "<unused_74>",
    "<unused_75>",
    "<unused_76>",
    "<unused_77>",
    "<unused_78>",
    "<unused_79>",
    "<unused_80>",
    "<unused_81>",
    "<unused_82>",
    "<unused_83>",
    "<unused_84>",
    "<unused_85>",
    "<unused_86>",
    "<unused_87>",
    "<unused_88>",
    "<unused_89>",
    "<unused_90>",
    "<unused_91>",
    "<unused_92>",
    "<unused_93>",
    "<unused_94>",
    "<unused_95>",
    "<unused_96>",
    "<unused_97>",
    "<unused_98>",
    "<unused_99>"
  ],
  "bos_token": {
    "content": "<bos>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "eos_token": {
    "content": "<eos>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": {
    "content": "<pad>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "unk_token": {
    "content": "<unk>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  }
}
